; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared1 - mode
	spectrograph3 - mode
	thermograph0 - mode
	spectrograph2 - mode
	Star4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation11 - direction
	GroundStation8 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation11)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation7)
)
(:goal (and
	(have_image Planet12 spectrograph2)
	(have_image Phenomenon13 spectrograph3)
	(have_image Planet14 thermograph0)
	(have_image Planet15 spectrograph3)
	(have_image Phenomenon16 thermograph0)
	(have_image Planet17 thermograph0)
	(have_image Star18 spectrograph3)
))

)

; plan
1. (turn_to satellite1 groundstation11 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 groundstation11)
   goals met: 0 of 7
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite1 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite1 phenomenon13 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 phenomenon13)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation3 groundstation6)
   deleted: (pointing satellite0 groundstation6)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 7
6. (take_image satellite1 phenomenon13 instrument2 spectrograph3)
   added: (have_image phenomenon13 spectrograph3)
   goals met: 1 of 7
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 7
8. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 1 of 7
9. (turn_to satellite0 phenomenon16 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 7
10. (take_image satellite0 phenomenon16 instrument1 thermograph0)
   added: (have_image phenomenon16 thermograph0)
   goals met: 2 of 7
11. (turn_to satellite0 planet14 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet14)
   goals met: 2 of 7
12. (take_image satellite0 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 3 of 7
13. (turn_to satellite0 planet17 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet17)
   goals met: 3 of 7
14. (take_image satellite0 planet17 instrument1 thermograph0)
   added: (have_image planet17 thermograph0)
   goals met: 4 of 7
15. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 4 of 7
16. (take_image satellite1 planet12 instrument2 spectrograph2)
   added: (have_image planet12 spectrograph2)
   goals met: 5 of 7
17. (turn_to satellite1 planet15 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet15)
   goals met: 5 of 7
18. (take_image satellite1 planet15 instrument2 spectrograph3)
   added: (have_image planet15 spectrograph3)
   goals met: 6 of 7
19. (turn_to satellite1 star18 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star18)
   goals met: 6 of 7
20. (take_image satellite1 star18 instrument2 spectrograph3)
   added: (have_image star18 spectrograph3)
   goals met: 7 of 7
